###################################################################

# Created by write_sdc on Sat Dec 10 21:30:31 2022

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_max_area 0
set_load -pin_load 0.2 [get_ports pready]
set_load -pin_load 0.2 [get_ports {prdata[31]}]
set_load -pin_load 0.2 [get_ports {prdata[30]}]
set_load -pin_load 0.2 [get_ports {prdata[29]}]
set_load -pin_load 0.2 [get_ports {prdata[28]}]
set_load -pin_load 0.2 [get_ports {prdata[27]}]
set_load -pin_load 0.2 [get_ports {prdata[26]}]
set_load -pin_load 0.2 [get_ports {prdata[25]}]
set_load -pin_load 0.2 [get_ports {prdata[24]}]
set_load -pin_load 0.2 [get_ports {prdata[23]}]
set_load -pin_load 0.2 [get_ports {prdata[22]}]
set_load -pin_load 0.2 [get_ports {prdata[21]}]
set_load -pin_load 0.2 [get_ports {prdata[20]}]
set_load -pin_load 0.2 [get_ports {prdata[19]}]
set_load -pin_load 0.2 [get_ports {prdata[18]}]
set_load -pin_load 0.2 [get_ports {prdata[17]}]
set_load -pin_load 0.2 [get_ports {prdata[16]}]
set_load -pin_load 0.2 [get_ports {prdata[15]}]
set_load -pin_load 0.2 [get_ports {prdata[14]}]
set_load -pin_load 0.2 [get_ports {prdata[13]}]
set_load -pin_load 0.2 [get_ports {prdata[12]}]
set_load -pin_load 0.2 [get_ports {prdata[11]}]
set_load -pin_load 0.2 [get_ports {prdata[10]}]
set_load -pin_load 0.2 [get_ports {prdata[9]}]
set_load -pin_load 0.2 [get_ports {prdata[8]}]
set_load -pin_load 0.2 [get_ports {prdata[7]}]
set_load -pin_load 0.2 [get_ports {prdata[6]}]
set_load -pin_load 0.2 [get_ports {prdata[5]}]
set_load -pin_load 0.2 [get_ports {prdata[4]}]
set_load -pin_load 0.2 [get_ports {prdata[3]}]
set_load -pin_load 0.2 [get_ports {prdata[2]}]
set_load -pin_load 0.2 [get_ports {prdata[1]}]
set_load -pin_load 0.2 [get_ports {prdata[0]}]
set_load -pin_load 0.2 [get_ports {timer_irq[7]}]
set_load -pin_load 0.2 [get_ports {timer_irq[6]}]
set_load -pin_load 0.2 [get_ports {timer_irq[5]}]
set_load -pin_load 0.2 [get_ports {timer_irq[4]}]
set_load -pin_load 0.2 [get_ports {timer_irq[3]}]
set_load -pin_load 0.2 [get_ports {timer_irq[2]}]
set_load -pin_load 0.2 [get_ports {timer_irq[1]}]
set_load -pin_load 0.2 [get_ports {timer_irq[0]}]
set_ideal_network -no_propagate  [get_ports presetn]
create_clock [get_ports pclk]  -period 9.5  -waveform {0 4.75}
set_clock_latency -max 0.95  [get_clocks pclk]
set_clock_latency -source 0.95  [get_clocks pclk]
set_clock_uncertainty 0.475  [get_clocks pclk]
set_clock_transition -max -rise 0.095 [get_clocks pclk]
set_clock_transition -max -fall 0.095 [get_clocks pclk]
set_clock_transition -min -rise 0.095 [get_clocks pclk]
set_clock_transition -min -fall 0.095 [get_clocks pclk]
set_false_path   -from [get_ports presetn]
set_input_delay -clock pclk  -max 3.8  [get_ports presetn]
set_input_delay -clock pclk  -min 0  [get_ports presetn]
set_input_delay -clock pclk  -max 3.8  [get_ports penable]
set_input_delay -clock pclk  -min 0  [get_ports penable]
set_input_delay -clock pclk  -max 3.8  [get_ports psel]
set_input_delay -clock pclk  -min 0  [get_ports psel]
set_input_delay -clock pclk  -max 3.8  [get_ports {paddr[31]}]
set_input_delay -clock pclk  -min 0  [get_ports {paddr[31]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {paddr[30]}]
set_input_delay -clock pclk  -min 0  [get_ports {paddr[30]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {paddr[29]}]
set_input_delay -clock pclk  -min 0  [get_ports {paddr[29]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {paddr[28]}]
set_input_delay -clock pclk  -min 0  [get_ports {paddr[28]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {paddr[27]}]
set_input_delay -clock pclk  -min 0  [get_ports {paddr[27]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {paddr[26]}]
set_input_delay -clock pclk  -min 0  [get_ports {paddr[26]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {paddr[25]}]
set_input_delay -clock pclk  -min 0  [get_ports {paddr[25]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {paddr[24]}]
set_input_delay -clock pclk  -min 0  [get_ports {paddr[24]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {paddr[23]}]
set_input_delay -clock pclk  -min 0  [get_ports {paddr[23]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {paddr[22]}]
set_input_delay -clock pclk  -min 0  [get_ports {paddr[22]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {paddr[21]}]
set_input_delay -clock pclk  -min 0  [get_ports {paddr[21]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {paddr[20]}]
set_input_delay -clock pclk  -min 0  [get_ports {paddr[20]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {paddr[19]}]
set_input_delay -clock pclk  -min 0  [get_ports {paddr[19]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {paddr[18]}]
set_input_delay -clock pclk  -min 0  [get_ports {paddr[18]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {paddr[17]}]
set_input_delay -clock pclk  -min 0  [get_ports {paddr[17]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {paddr[16]}]
set_input_delay -clock pclk  -min 0  [get_ports {paddr[16]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {paddr[15]}]
set_input_delay -clock pclk  -min 0  [get_ports {paddr[15]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {paddr[14]}]
set_input_delay -clock pclk  -min 0  [get_ports {paddr[14]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {paddr[13]}]
set_input_delay -clock pclk  -min 0  [get_ports {paddr[13]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {paddr[12]}]
set_input_delay -clock pclk  -min 0  [get_ports {paddr[12]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {paddr[11]}]
set_input_delay -clock pclk  -min 0  [get_ports {paddr[11]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {paddr[10]}]
set_input_delay -clock pclk  -min 0  [get_ports {paddr[10]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {paddr[9]}]
set_input_delay -clock pclk  -min 0  [get_ports {paddr[9]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {paddr[8]}]
set_input_delay -clock pclk  -min 0  [get_ports {paddr[8]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {paddr[7]}]
set_input_delay -clock pclk  -min 0  [get_ports {paddr[7]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {paddr[6]}]
set_input_delay -clock pclk  -min 0  [get_ports {paddr[6]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {paddr[5]}]
set_input_delay -clock pclk  -min 0  [get_ports {paddr[5]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {paddr[4]}]
set_input_delay -clock pclk  -min 0  [get_ports {paddr[4]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {paddr[3]}]
set_input_delay -clock pclk  -min 0  [get_ports {paddr[3]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {paddr[2]}]
set_input_delay -clock pclk  -min 0  [get_ports {paddr[2]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {paddr[1]}]
set_input_delay -clock pclk  -min 0  [get_ports {paddr[1]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {paddr[0]}]
set_input_delay -clock pclk  -min 0  [get_ports {paddr[0]}]
set_input_delay -clock pclk  -max 3.8  [get_ports pwrite]
set_input_delay -clock pclk  -min 0  [get_ports pwrite]
set_input_delay -clock pclk  -max 3.8  [get_ports {pwdata[31]}]
set_input_delay -clock pclk  -min 0  [get_ports {pwdata[31]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {pwdata[30]}]
set_input_delay -clock pclk  -min 0  [get_ports {pwdata[30]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {pwdata[29]}]
set_input_delay -clock pclk  -min 0  [get_ports {pwdata[29]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {pwdata[28]}]
set_input_delay -clock pclk  -min 0  [get_ports {pwdata[28]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {pwdata[27]}]
set_input_delay -clock pclk  -min 0  [get_ports {pwdata[27]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {pwdata[26]}]
set_input_delay -clock pclk  -min 0  [get_ports {pwdata[26]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {pwdata[25]}]
set_input_delay -clock pclk  -min 0  [get_ports {pwdata[25]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {pwdata[24]}]
set_input_delay -clock pclk  -min 0  [get_ports {pwdata[24]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {pwdata[23]}]
set_input_delay -clock pclk  -min 0  [get_ports {pwdata[23]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {pwdata[22]}]
set_input_delay -clock pclk  -min 0  [get_ports {pwdata[22]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {pwdata[21]}]
set_input_delay -clock pclk  -min 0  [get_ports {pwdata[21]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {pwdata[20]}]
set_input_delay -clock pclk  -min 0  [get_ports {pwdata[20]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {pwdata[19]}]
set_input_delay -clock pclk  -min 0  [get_ports {pwdata[19]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {pwdata[18]}]
set_input_delay -clock pclk  -min 0  [get_ports {pwdata[18]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {pwdata[17]}]
set_input_delay -clock pclk  -min 0  [get_ports {pwdata[17]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {pwdata[16]}]
set_input_delay -clock pclk  -min 0  [get_ports {pwdata[16]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {pwdata[15]}]
set_input_delay -clock pclk  -min 0  [get_ports {pwdata[15]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {pwdata[14]}]
set_input_delay -clock pclk  -min 0  [get_ports {pwdata[14]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {pwdata[13]}]
set_input_delay -clock pclk  -min 0  [get_ports {pwdata[13]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {pwdata[12]}]
set_input_delay -clock pclk  -min 0  [get_ports {pwdata[12]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {pwdata[11]}]
set_input_delay -clock pclk  -min 0  [get_ports {pwdata[11]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {pwdata[10]}]
set_input_delay -clock pclk  -min 0  [get_ports {pwdata[10]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {pwdata[9]}]
set_input_delay -clock pclk  -min 0  [get_ports {pwdata[9]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {pwdata[8]}]
set_input_delay -clock pclk  -min 0  [get_ports {pwdata[8]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {pwdata[7]}]
set_input_delay -clock pclk  -min 0  [get_ports {pwdata[7]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {pwdata[6]}]
set_input_delay -clock pclk  -min 0  [get_ports {pwdata[6]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {pwdata[5]}]
set_input_delay -clock pclk  -min 0  [get_ports {pwdata[5]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {pwdata[4]}]
set_input_delay -clock pclk  -min 0  [get_ports {pwdata[4]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {pwdata[3]}]
set_input_delay -clock pclk  -min 0  [get_ports {pwdata[3]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {pwdata[2]}]
set_input_delay -clock pclk  -min 0  [get_ports {pwdata[2]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {pwdata[1]}]
set_input_delay -clock pclk  -min 0  [get_ports {pwdata[1]}]
set_input_delay -clock pclk  -max 3.8  [get_ports {pwdata[0]}]
set_input_delay -clock pclk  -min 0  [get_ports {pwdata[0]}]
set_output_delay -clock pclk  -max 3.8  [get_ports pready]
set_output_delay -clock pclk  -min 0  [get_ports pready]
set_output_delay -clock pclk  -max 3.8  [get_ports {prdata[31]}]
set_output_delay -clock pclk  -min 0  [get_ports {prdata[31]}]
set_output_delay -clock pclk  -max 3.8  [get_ports {prdata[30]}]
set_output_delay -clock pclk  -min 0  [get_ports {prdata[30]}]
set_output_delay -clock pclk  -max 3.8  [get_ports {prdata[29]}]
set_output_delay -clock pclk  -min 0  [get_ports {prdata[29]}]
set_output_delay -clock pclk  -max 3.8  [get_ports {prdata[28]}]
set_output_delay -clock pclk  -min 0  [get_ports {prdata[28]}]
set_output_delay -clock pclk  -max 3.8  [get_ports {prdata[27]}]
set_output_delay -clock pclk  -min 0  [get_ports {prdata[27]}]
set_output_delay -clock pclk  -max 3.8  [get_ports {prdata[26]}]
set_output_delay -clock pclk  -min 0  [get_ports {prdata[26]}]
set_output_delay -clock pclk  -max 3.8  [get_ports {prdata[25]}]
set_output_delay -clock pclk  -min 0  [get_ports {prdata[25]}]
set_output_delay -clock pclk  -max 3.8  [get_ports {prdata[24]}]
set_output_delay -clock pclk  -min 0  [get_ports {prdata[24]}]
set_output_delay -clock pclk  -max 3.8  [get_ports {prdata[23]}]
set_output_delay -clock pclk  -min 0  [get_ports {prdata[23]}]
set_output_delay -clock pclk  -max 3.8  [get_ports {prdata[22]}]
set_output_delay -clock pclk  -min 0  [get_ports {prdata[22]}]
set_output_delay -clock pclk  -max 3.8  [get_ports {prdata[21]}]
set_output_delay -clock pclk  -min 0  [get_ports {prdata[21]}]
set_output_delay -clock pclk  -max 3.8  [get_ports {prdata[20]}]
set_output_delay -clock pclk  -min 0  [get_ports {prdata[20]}]
set_output_delay -clock pclk  -max 3.8  [get_ports {prdata[19]}]
set_output_delay -clock pclk  -min 0  [get_ports {prdata[19]}]
set_output_delay -clock pclk  -max 3.8  [get_ports {prdata[18]}]
set_output_delay -clock pclk  -min 0  [get_ports {prdata[18]}]
set_output_delay -clock pclk  -max 3.8  [get_ports {prdata[17]}]
set_output_delay -clock pclk  -min 0  [get_ports {prdata[17]}]
set_output_delay -clock pclk  -max 3.8  [get_ports {prdata[16]}]
set_output_delay -clock pclk  -min 0  [get_ports {prdata[16]}]
set_output_delay -clock pclk  -max 3.8  [get_ports {prdata[15]}]
set_output_delay -clock pclk  -min 0  [get_ports {prdata[15]}]
set_output_delay -clock pclk  -max 3.8  [get_ports {prdata[14]}]
set_output_delay -clock pclk  -min 0  [get_ports {prdata[14]}]
set_output_delay -clock pclk  -max 3.8  [get_ports {prdata[13]}]
set_output_delay -clock pclk  -min 0  [get_ports {prdata[13]}]
set_output_delay -clock pclk  -max 3.8  [get_ports {prdata[12]}]
set_output_delay -clock pclk  -min 0  [get_ports {prdata[12]}]
set_output_delay -clock pclk  -max 3.8  [get_ports {prdata[11]}]
set_output_delay -clock pclk  -min 0  [get_ports {prdata[11]}]
set_output_delay -clock pclk  -max 3.8  [get_ports {prdata[10]}]
set_output_delay -clock pclk  -min 0  [get_ports {prdata[10]}]
set_output_delay -clock pclk  -max 3.8  [get_ports {prdata[9]}]
set_output_delay -clock pclk  -min 0  [get_ports {prdata[9]}]
set_output_delay -clock pclk  -max 3.8  [get_ports {prdata[8]}]
set_output_delay -clock pclk  -min 0  [get_ports {prdata[8]}]
set_output_delay -clock pclk  -max 3.8  [get_ports {prdata[7]}]
set_output_delay -clock pclk  -min 0  [get_ports {prdata[7]}]
set_output_delay -clock pclk  -max 3.8  [get_ports {prdata[6]}]
set_output_delay -clock pclk  -min 0  [get_ports {prdata[6]}]
set_output_delay -clock pclk  -max 3.8  [get_ports {prdata[5]}]
set_output_delay -clock pclk  -min 0  [get_ports {prdata[5]}]
set_output_delay -clock pclk  -max 3.8  [get_ports {prdata[4]}]
set_output_delay -clock pclk  -min 0  [get_ports {prdata[4]}]
set_output_delay -clock pclk  -max 3.8  [get_ports {prdata[3]}]
set_output_delay -clock pclk  -min 0  [get_ports {prdata[3]}]
set_output_delay -clock pclk  -max 3.8  [get_ports {prdata[2]}]
set_output_delay -clock pclk  -min 0  [get_ports {prdata[2]}]
set_output_delay -clock pclk  -max 3.8  [get_ports {prdata[1]}]
set_output_delay -clock pclk  -min 0  [get_ports {prdata[1]}]
set_output_delay -clock pclk  -max 3.8  [get_ports {prdata[0]}]
set_output_delay -clock pclk  -min 0  [get_ports {prdata[0]}]
set_output_delay -clock pclk  -max 3.8  [get_ports {timer_irq[7]}]
set_output_delay -clock pclk  -min 0  [get_ports {timer_irq[7]}]
set_output_delay -clock pclk  -max 3.8  [get_ports {timer_irq[6]}]
set_output_delay -clock pclk  -min 0  [get_ports {timer_irq[6]}]
set_output_delay -clock pclk  -max 3.8  [get_ports {timer_irq[5]}]
set_output_delay -clock pclk  -min 0  [get_ports {timer_irq[5]}]
set_output_delay -clock pclk  -max 3.8  [get_ports {timer_irq[4]}]
set_output_delay -clock pclk  -min 0  [get_ports {timer_irq[4]}]
set_output_delay -clock pclk  -max 3.8  [get_ports {timer_irq[3]}]
set_output_delay -clock pclk  -min 0  [get_ports {timer_irq[3]}]
set_output_delay -clock pclk  -max 3.8  [get_ports {timer_irq[2]}]
set_output_delay -clock pclk  -min 0  [get_ports {timer_irq[2]}]
set_output_delay -clock pclk  -max 3.8  [get_ports {timer_irq[1]}]
set_output_delay -clock pclk  -min 0  [get_ports {timer_irq[1]}]
set_output_delay -clock pclk  -max 3.8  [get_ports {timer_irq[0]}]
set_output_delay -clock pclk  -min 0  [get_ports {timer_irq[0]}]
