###################################################################

# Created by write_sdc on Tue Dec  6 22:35:21 2022

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_max_area 0
set_load -pin_load 0.2 [get_ports div_doing_o]
set_load -pin_load 0.2 [get_ports div_qrvalid_o]
set_load -pin_load 0.2 [get_ports {div_quotient_o[63]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[62]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[61]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[60]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[59]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[58]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[57]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[56]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[55]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[54]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[53]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[52]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[51]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[50]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[49]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[48]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[47]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[46]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[45]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[44]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[43]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[42]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[41]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[40]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[39]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[38]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[37]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[36]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[35]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[34]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[33]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[32]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[31]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[30]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[29]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[28]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[27]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[26]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[25]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[24]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[23]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[22]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[21]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[20]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[19]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[18]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[17]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[16]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[15]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[14]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[13]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[12]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[11]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[10]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[9]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[8]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[7]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[6]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[5]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[4]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[3]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[2]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[1]}]
set_load -pin_load 0.2 [get_ports {div_quotient_o[0]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[63]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[62]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[61]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[60]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[59]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[58]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[57]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[56]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[55]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[54]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[53]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[52]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[51]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[50]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[49]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[48]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[47]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[46]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[45]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[44]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[43]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[42]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[41]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[40]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[39]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[38]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[37]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[36]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[35]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[34]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[33]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[32]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[31]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[30]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[29]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[28]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[27]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[26]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[25]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[24]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[23]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[22]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[21]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[20]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[19]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[18]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[17]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[16]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[15]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[14]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[13]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[12]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[11]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[10]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[9]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[8]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[7]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[6]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[5]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[4]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[3]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[2]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[1]}]
set_load -pin_load 0.2 [get_ports {div_remainder_o[0]}]
set_ideal_network -no_propagate  [get_ports rst]
create_clock [get_ports clk]  -period 9.5  -waveform {0 4.75}
set_clock_latency -max 0.95  [get_clocks clk]
set_clock_latency -source 0.95  [get_clocks clk]
set_clock_uncertainty 0.475  [get_clocks clk]
set_clock_transition -max -rise 0.095 [get_clocks clk]
set_clock_transition -max -fall 0.095 [get_clocks clk]
set_clock_transition -min -rise 0.095 [get_clocks clk]
set_clock_transition -min -fall 0.095 [get_clocks clk]
set_false_path   -from [get_ports rst]
set_input_delay -clock clk  -max 3.8  [get_ports rst]
set_input_delay -clock clk  -min 0  [get_ports rst]
set_input_delay -clock clk  -max 3.8  [get_ports div_ready]
set_input_delay -clock clk  -min 0  [get_ports div_ready]
set_input_delay -clock clk  -max 3.8  [get_ports div_datavalid_i]
set_input_delay -clock clk  -min 0  [get_ports div_datavalid_i]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[63]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[63]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[62]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[62]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[61]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[61]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[60]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[60]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[59]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[59]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[58]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[58]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[57]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[57]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[56]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[56]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[55]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[55]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[54]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[54]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[53]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[53]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[52]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[52]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[51]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[51]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[50]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[50]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[49]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[49]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[48]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[48]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[47]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[47]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[46]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[46]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[45]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[45]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[44]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[44]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[43]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[43]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[42]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[42]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[41]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[41]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[40]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[40]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[39]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[39]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[38]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[38]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[37]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[37]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[36]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[36]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[35]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[35]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[34]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[34]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[33]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[33]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[32]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[32]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[31]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[31]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[30]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[30]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[29]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[29]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[28]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[28]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[27]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[27]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[26]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[26]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[25]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[25]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[24]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[24]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[23]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[23]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[22]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[22]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[21]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[21]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[20]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[20]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[19]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[19]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[18]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[18]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[17]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[17]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[16]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[16]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[15]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[15]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[14]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[14]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[13]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[13]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[12]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[12]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[11]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[11]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[10]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[10]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[9]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[9]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[8]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[8]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[7]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[7]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[6]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[6]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[5]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[5]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[4]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[4]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[3]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[3]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[2]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[2]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[1]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[1]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_dividend_i[0]}]
set_input_delay -clock clk  -min 0  [get_ports {div_dividend_i[0]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[63]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[63]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[62]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[62]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[61]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[61]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[60]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[60]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[59]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[59]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[58]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[58]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[57]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[57]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[56]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[56]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[55]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[55]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[54]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[54]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[53]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[53]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[52]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[52]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[51]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[51]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[50]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[50]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[49]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[49]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[48]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[48]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[47]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[47]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[46]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[46]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[45]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[45]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[44]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[44]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[43]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[43]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[42]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[42]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[41]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[41]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[40]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[40]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[39]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[39]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[38]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[38]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[37]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[37]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[36]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[36]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[35]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[35]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[34]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[34]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[33]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[33]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[32]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[32]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[31]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[31]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[30]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[30]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[29]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[29]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[28]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[28]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[27]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[27]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[26]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[26]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[25]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[25]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[24]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[24]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[23]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[23]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[22]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[22]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[21]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[21]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[20]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[20]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[19]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[19]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[18]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[18]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[17]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[17]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[16]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[16]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[15]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[15]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[14]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[14]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[13]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[13]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[12]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[12]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[11]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[11]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[10]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[10]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[9]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[9]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[8]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[8]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[7]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[7]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[6]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[6]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[5]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[5]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[4]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[4]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[3]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[3]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[2]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[2]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[1]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[1]}]
set_input_delay -clock clk  -max 3.8  [get_ports {div_divisor_i[0]}]
set_input_delay -clock clk  -min 0  [get_ports {div_divisor_i[0]}]
set_output_delay -clock clk  -max 3.8  [get_ports div_doing_o]
set_output_delay -clock clk  -min 0  [get_ports div_doing_o]
set_output_delay -clock clk  -max 3.8  [get_ports div_qrvalid_o]
set_output_delay -clock clk  -min 0  [get_ports div_qrvalid_o]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[63]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[63]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[62]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[62]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[61]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[61]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[60]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[60]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[59]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[59]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[58]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[58]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[57]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[57]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[56]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[56]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[55]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[55]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[54]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[54]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[53]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[53]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[52]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[52]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[51]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[51]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[50]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[50]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[49]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[49]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[48]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[48]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[47]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[47]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[46]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[46]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[45]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[45]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[44]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[44]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[43]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[43]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[42]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[42]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[41]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[41]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[40]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[40]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[39]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[39]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[38]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[38]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[37]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[37]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[36]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[36]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[35]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[35]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[34]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[34]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[33]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[33]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[32]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[32]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[31]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[31]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[30]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[30]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[29]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[29]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[28]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[28]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[27]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[27]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[26]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[26]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[25]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[25]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[24]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[24]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[23]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[23]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[22]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[22]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[21]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[21]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[20]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[20]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[19]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[19]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[18]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[18]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[17]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[17]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[16]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[16]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[15]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[15]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[14]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[14]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[13]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[13]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[12]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[12]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[11]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[11]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[10]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[10]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[9]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[9]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[8]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[8]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[7]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[7]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[6]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[6]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[5]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[5]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[4]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[4]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[3]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[3]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[2]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[2]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[1]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[1]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_quotient_o[0]}]
set_output_delay -clock clk  -min 0  [get_ports {div_quotient_o[0]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[63]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[63]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[62]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[62]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[61]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[61]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[60]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[60]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[59]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[59]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[58]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[58]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[57]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[57]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[56]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[56]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[55]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[55]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[54]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[54]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[53]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[53]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[52]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[52]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[51]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[51]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[50]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[50]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[49]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[49]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[48]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[48]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[47]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[47]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[46]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[46]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[45]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[45]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[44]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[44]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[43]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[43]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[42]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[42]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[41]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[41]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[40]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[40]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[39]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[39]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[38]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[38]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[37]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[37]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[36]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[36]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[35]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[35]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[34]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[34]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[33]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[33]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[32]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[32]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[31]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[31]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[30]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[30]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[29]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[29]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[28]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[28]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[27]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[27]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[26]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[26]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[25]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[25]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[24]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[24]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[23]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[23]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[22]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[22]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[21]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[21]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[20]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[20]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[19]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[19]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[18]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[18]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[17]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[17]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[16]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[16]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[15]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[15]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[14]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[14]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[13]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[13]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[12]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[12]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[11]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[11]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[10]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[10]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[9]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[9]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[8]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[8]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[7]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[7]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[6]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[6]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[5]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[5]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[4]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[4]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[3]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[3]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[2]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[2]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[1]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[1]}]
set_output_delay -clock clk  -max 3.8  [get_ports {div_remainder_o[0]}]
set_output_delay -clock clk  -min 0  [get_ports {div_remainder_o[0]}]
