###################################################################

# Created by write_sdc on Sun Nov 13 17:30:43 2022

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_max_area 0
set_load -pin_load 0.2 [get_ports vld_out]
set_load -pin_load 0.2 [get_ports {y[16]}]
set_load -pin_load 0.2 [get_ports {y[15]}]
set_load -pin_load 0.2 [get_ports {y[14]}]
set_load -pin_load 0.2 [get_ports {y[13]}]
set_load -pin_load 0.2 [get_ports {y[12]}]
set_load -pin_load 0.2 [get_ports {y[11]}]
set_load -pin_load 0.2 [get_ports {y[10]}]
set_load -pin_load 0.2 [get_ports {y[9]}]
set_load -pin_load 0.2 [get_ports {y[8]}]
set_load -pin_load 0.2 [get_ports {y[7]}]
set_load -pin_load 0.2 [get_ports {y[6]}]
set_load -pin_load 0.2 [get_ports {y[5]}]
set_load -pin_load 0.2 [get_ports {y[4]}]
set_load -pin_load 0.2 [get_ports {y[3]}]
set_load -pin_load 0.2 [get_ports {y[2]}]
set_load -pin_load 0.2 [get_ports {y[1]}]
set_load -pin_load 0.2 [get_ports {y[0]}]
set_ideal_network -no_propagate  [get_ports rst_n]
create_clock [get_ports clk]  -period 9.5  -waveform {0 4.75}
set_clock_latency -max 0.95  [get_clocks clk]
set_clock_latency -source 0.95  [get_clocks clk]
set_clock_uncertainty 0.475  [get_clocks clk]
set_clock_transition -max -rise 0.095 [get_clocks clk]
set_clock_transition -max -fall 0.095 [get_clocks clk]
set_clock_transition -min -rise 0.095 [get_clocks clk]
set_clock_transition -min -fall 0.095 [get_clocks clk]
set_false_path   -from [get_ports rst_n]
set_input_delay -clock clk  -max 3.8  [get_ports rst_n]
set_input_delay -clock clk  -min 0  [get_ports rst_n]
set_input_delay -clock clk  -max 3.8  [get_ports vld_in]
set_input_delay -clock clk  -min 0  [get_ports vld_in]
set_input_delay -clock clk  -max 3.8  [get_ports {x[31]}]
set_input_delay -clock clk  -min 0  [get_ports {x[31]}]
set_input_delay -clock clk  -max 3.8  [get_ports {x[30]}]
set_input_delay -clock clk  -min 0  [get_ports {x[30]}]
set_input_delay -clock clk  -max 3.8  [get_ports {x[29]}]
set_input_delay -clock clk  -min 0  [get_ports {x[29]}]
set_input_delay -clock clk  -max 3.8  [get_ports {x[28]}]
set_input_delay -clock clk  -min 0  [get_ports {x[28]}]
set_input_delay -clock clk  -max 3.8  [get_ports {x[27]}]
set_input_delay -clock clk  -min 0  [get_ports {x[27]}]
set_input_delay -clock clk  -max 3.8  [get_ports {x[26]}]
set_input_delay -clock clk  -min 0  [get_ports {x[26]}]
set_input_delay -clock clk  -max 3.8  [get_ports {x[25]}]
set_input_delay -clock clk  -min 0  [get_ports {x[25]}]
set_input_delay -clock clk  -max 3.8  [get_ports {x[24]}]
set_input_delay -clock clk  -min 0  [get_ports {x[24]}]
set_input_delay -clock clk  -max 3.8  [get_ports {x[23]}]
set_input_delay -clock clk  -min 0  [get_ports {x[23]}]
set_input_delay -clock clk  -max 3.8  [get_ports {x[22]}]
set_input_delay -clock clk  -min 0  [get_ports {x[22]}]
set_input_delay -clock clk  -max 3.8  [get_ports {x[21]}]
set_input_delay -clock clk  -min 0  [get_ports {x[21]}]
set_input_delay -clock clk  -max 3.8  [get_ports {x[20]}]
set_input_delay -clock clk  -min 0  [get_ports {x[20]}]
set_input_delay -clock clk  -max 3.8  [get_ports {x[19]}]
set_input_delay -clock clk  -min 0  [get_ports {x[19]}]
set_input_delay -clock clk  -max 3.8  [get_ports {x[18]}]
set_input_delay -clock clk  -min 0  [get_ports {x[18]}]
set_input_delay -clock clk  -max 3.8  [get_ports {x[17]}]
set_input_delay -clock clk  -min 0  [get_ports {x[17]}]
set_input_delay -clock clk  -max 3.8  [get_ports {x[16]}]
set_input_delay -clock clk  -min 0  [get_ports {x[16]}]
set_input_delay -clock clk  -max 3.8  [get_ports {x[15]}]
set_input_delay -clock clk  -min 0  [get_ports {x[15]}]
set_input_delay -clock clk  -max 3.8  [get_ports {x[14]}]
set_input_delay -clock clk  -min 0  [get_ports {x[14]}]
set_input_delay -clock clk  -max 3.8  [get_ports {x[13]}]
set_input_delay -clock clk  -min 0  [get_ports {x[13]}]
set_input_delay -clock clk  -max 3.8  [get_ports {x[12]}]
set_input_delay -clock clk  -min 0  [get_ports {x[12]}]
set_input_delay -clock clk  -max 3.8  [get_ports {x[11]}]
set_input_delay -clock clk  -min 0  [get_ports {x[11]}]
set_input_delay -clock clk  -max 3.8  [get_ports {x[10]}]
set_input_delay -clock clk  -min 0  [get_ports {x[10]}]
set_input_delay -clock clk  -max 3.8  [get_ports {x[9]}]
set_input_delay -clock clk  -min 0  [get_ports {x[9]}]
set_input_delay -clock clk  -max 3.8  [get_ports {x[8]}]
set_input_delay -clock clk  -min 0  [get_ports {x[8]}]
set_input_delay -clock clk  -max 3.8  [get_ports {x[7]}]
set_input_delay -clock clk  -min 0  [get_ports {x[7]}]
set_input_delay -clock clk  -max 3.8  [get_ports {x[6]}]
set_input_delay -clock clk  -min 0  [get_ports {x[6]}]
set_input_delay -clock clk  -max 3.8  [get_ports {x[5]}]
set_input_delay -clock clk  -min 0  [get_ports {x[5]}]
set_input_delay -clock clk  -max 3.8  [get_ports {x[4]}]
set_input_delay -clock clk  -min 0  [get_ports {x[4]}]
set_input_delay -clock clk  -max 3.8  [get_ports {x[3]}]
set_input_delay -clock clk  -min 0  [get_ports {x[3]}]
set_input_delay -clock clk  -max 3.8  [get_ports {x[2]}]
set_input_delay -clock clk  -min 0  [get_ports {x[2]}]
set_input_delay -clock clk  -max 3.8  [get_ports {x[1]}]
set_input_delay -clock clk  -min 0  [get_ports {x[1]}]
set_input_delay -clock clk  -max 3.8  [get_ports {x[0]}]
set_input_delay -clock clk  -min 0  [get_ports {x[0]}]
set_output_delay -clock clk  -max 3.8  [get_ports vld_out]
set_output_delay -clock clk  -min 0  [get_ports vld_out]
set_output_delay -clock clk  -max 3.8  [get_ports {y[16]}]
set_output_delay -clock clk  -min 0  [get_ports {y[16]}]
set_output_delay -clock clk  -max 3.8  [get_ports {y[15]}]
set_output_delay -clock clk  -min 0  [get_ports {y[15]}]
set_output_delay -clock clk  -max 3.8  [get_ports {y[14]}]
set_output_delay -clock clk  -min 0  [get_ports {y[14]}]
set_output_delay -clock clk  -max 3.8  [get_ports {y[13]}]
set_output_delay -clock clk  -min 0  [get_ports {y[13]}]
set_output_delay -clock clk  -max 3.8  [get_ports {y[12]}]
set_output_delay -clock clk  -min 0  [get_ports {y[12]}]
set_output_delay -clock clk  -max 3.8  [get_ports {y[11]}]
set_output_delay -clock clk  -min 0  [get_ports {y[11]}]
set_output_delay -clock clk  -max 3.8  [get_ports {y[10]}]
set_output_delay -clock clk  -min 0  [get_ports {y[10]}]
set_output_delay -clock clk  -max 3.8  [get_ports {y[9]}]
set_output_delay -clock clk  -min 0  [get_ports {y[9]}]
set_output_delay -clock clk  -max 3.8  [get_ports {y[8]}]
set_output_delay -clock clk  -min 0  [get_ports {y[8]}]
set_output_delay -clock clk  -max 3.8  [get_ports {y[7]}]
set_output_delay -clock clk  -min 0  [get_ports {y[7]}]
set_output_delay -clock clk  -max 3.8  [get_ports {y[6]}]
set_output_delay -clock clk  -min 0  [get_ports {y[6]}]
set_output_delay -clock clk  -max 3.8  [get_ports {y[5]}]
set_output_delay -clock clk  -min 0  [get_ports {y[5]}]
set_output_delay -clock clk  -max 3.8  [get_ports {y[4]}]
set_output_delay -clock clk  -min 0  [get_ports {y[4]}]
set_output_delay -clock clk  -max 3.8  [get_ports {y[3]}]
set_output_delay -clock clk  -min 0  [get_ports {y[3]}]
set_output_delay -clock clk  -max 3.8  [get_ports {y[2]}]
set_output_delay -clock clk  -min 0  [get_ports {y[2]}]
set_output_delay -clock clk  -max 3.8  [get_ports {y[1]}]
set_output_delay -clock clk  -min 0  [get_ports {y[1]}]
set_output_delay -clock clk  -max 3.8  [get_ports {y[0]}]
set_output_delay -clock clk  -min 0  [get_ports {y[0]}]
