###################################################################

# Created by write_sdc on Sun Nov 13 17:28:42 2022

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_max_area 0
set_load -pin_load 0.2 [get_ports hready]
set_load -pin_load 0.2 [get_ports {hresp[1]}]
set_load -pin_load 0.2 [get_ports {hresp[0]}]
set_load -pin_load 0.2 [get_ports {hrdata[31]}]
set_load -pin_load 0.2 [get_ports {hrdata[30]}]
set_load -pin_load 0.2 [get_ports {hrdata[29]}]
set_load -pin_load 0.2 [get_ports {hrdata[28]}]
set_load -pin_load 0.2 [get_ports {hrdata[27]}]
set_load -pin_load 0.2 [get_ports {hrdata[26]}]
set_load -pin_load 0.2 [get_ports {hrdata[25]}]
set_load -pin_load 0.2 [get_ports {hrdata[24]}]
set_load -pin_load 0.2 [get_ports {hrdata[23]}]
set_load -pin_load 0.2 [get_ports {hrdata[22]}]
set_load -pin_load 0.2 [get_ports {hrdata[21]}]
set_load -pin_load 0.2 [get_ports {hrdata[20]}]
set_load -pin_load 0.2 [get_ports {hrdata[19]}]
set_load -pin_load 0.2 [get_ports {hrdata[18]}]
set_load -pin_load 0.2 [get_ports {hrdata[17]}]
set_load -pin_load 0.2 [get_ports {hrdata[16]}]
set_load -pin_load 0.2 [get_ports {hrdata[15]}]
set_load -pin_load 0.2 [get_ports {hrdata[14]}]
set_load -pin_load 0.2 [get_ports {hrdata[13]}]
set_load -pin_load 0.2 [get_ports {hrdata[12]}]
set_load -pin_load 0.2 [get_ports {hrdata[11]}]
set_load -pin_load 0.2 [get_ports {hrdata[10]}]
set_load -pin_load 0.2 [get_ports {hrdata[9]}]
set_load -pin_load 0.2 [get_ports {hrdata[8]}]
set_load -pin_load 0.2 [get_ports {hrdata[7]}]
set_load -pin_load 0.2 [get_ports {hrdata[6]}]
set_load -pin_load 0.2 [get_ports {hrdata[5]}]
set_load -pin_load 0.2 [get_ports {hrdata[4]}]
set_load -pin_load 0.2 [get_ports {hrdata[3]}]
set_load -pin_load 0.2 [get_ports {hrdata[2]}]
set_load -pin_load 0.2 [get_ports {hrdata[1]}]
set_load -pin_load 0.2 [get_ports {hrdata[0]}]
set_load -pin_load 0.2 [get_ports sram_csn]
set_load -pin_load 0.2 [get_ports sram_wen]
set_load -pin_load 0.2 [get_ports {sram_a[11]}]
set_load -pin_load 0.2 [get_ports {sram_a[10]}]
set_load -pin_load 0.2 [get_ports {sram_a[9]}]
set_load -pin_load 0.2 [get_ports {sram_a[8]}]
set_load -pin_load 0.2 [get_ports {sram_a[7]}]
set_load -pin_load 0.2 [get_ports {sram_a[6]}]
set_load -pin_load 0.2 [get_ports {sram_a[5]}]
set_load -pin_load 0.2 [get_ports {sram_a[4]}]
set_load -pin_load 0.2 [get_ports {sram_a[3]}]
set_load -pin_load 0.2 [get_ports {sram_a[2]}]
set_load -pin_load 0.2 [get_ports {sram_a[1]}]
set_load -pin_load 0.2 [get_ports {sram_a[0]}]
set_load -pin_load 0.2 [get_ports {sram_d[31]}]
set_load -pin_load 0.2 [get_ports {sram_d[30]}]
set_load -pin_load 0.2 [get_ports {sram_d[29]}]
set_load -pin_load 0.2 [get_ports {sram_d[28]}]
set_load -pin_load 0.2 [get_ports {sram_d[27]}]
set_load -pin_load 0.2 [get_ports {sram_d[26]}]
set_load -pin_load 0.2 [get_ports {sram_d[25]}]
set_load -pin_load 0.2 [get_ports {sram_d[24]}]
set_load -pin_load 0.2 [get_ports {sram_d[23]}]
set_load -pin_load 0.2 [get_ports {sram_d[22]}]
set_load -pin_load 0.2 [get_ports {sram_d[21]}]
set_load -pin_load 0.2 [get_ports {sram_d[20]}]
set_load -pin_load 0.2 [get_ports {sram_d[19]}]
set_load -pin_load 0.2 [get_ports {sram_d[18]}]
set_load -pin_load 0.2 [get_ports {sram_d[17]}]
set_load -pin_load 0.2 [get_ports {sram_d[16]}]
set_load -pin_load 0.2 [get_ports {sram_d[15]}]
set_load -pin_load 0.2 [get_ports {sram_d[14]}]
set_load -pin_load 0.2 [get_ports {sram_d[13]}]
set_load -pin_load 0.2 [get_ports {sram_d[12]}]
set_load -pin_load 0.2 [get_ports {sram_d[11]}]
set_load -pin_load 0.2 [get_ports {sram_d[10]}]
set_load -pin_load 0.2 [get_ports {sram_d[9]}]
set_load -pin_load 0.2 [get_ports {sram_d[8]}]
set_load -pin_load 0.2 [get_ports {sram_d[7]}]
set_load -pin_load 0.2 [get_ports {sram_d[6]}]
set_load -pin_load 0.2 [get_ports {sram_d[5]}]
set_load -pin_load 0.2 [get_ports {sram_d[4]}]
set_load -pin_load 0.2 [get_ports {sram_d[3]}]
set_load -pin_load 0.2 [get_ports {sram_d[2]}]
set_load -pin_load 0.2 [get_ports {sram_d[1]}]
set_load -pin_load 0.2 [get_ports {sram_d[0]}]
set_ideal_network -no_propagate  [get_ports hresetn]
create_clock [get_ports hclk]  -period 9.5  -waveform {0 4.75}
set_clock_latency -max 0.95  [get_clocks hclk]
set_clock_latency -source 0.95  [get_clocks hclk]
set_clock_uncertainty 0.475  [get_clocks hclk]
set_clock_transition -max -rise 0.095 [get_clocks hclk]
set_clock_transition -max -fall 0.095 [get_clocks hclk]
set_clock_transition -min -rise 0.095 [get_clocks hclk]
set_clock_transition -min -fall 0.095 [get_clocks hclk]
set_false_path   -from [get_ports hresetn]
set_input_delay -clock hclk  -max 3.8  [get_ports hresetn]
set_input_delay -clock hclk  -min 0  [get_ports hresetn]
set_input_delay -clock hclk  -max 3.8  [get_ports hwrite]
set_input_delay -clock hclk  -min 0  [get_ports hwrite]
set_input_delay -clock hclk  -max 3.8  [get_ports {htrans[1]}]
set_input_delay -clock hclk  -min 0  [get_ports {htrans[1]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {htrans[0]}]
set_input_delay -clock hclk  -min 0  [get_ports {htrans[0]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {hsize[2]}]
set_input_delay -clock hclk  -min 0  [get_ports {hsize[2]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {hsize[1]}]
set_input_delay -clock hclk  -min 0  [get_ports {hsize[1]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {hsize[0]}]
set_input_delay -clock hclk  -min 0  [get_ports {hsize[0]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {haddr[31]}]
set_input_delay -clock hclk  -min 0  [get_ports {haddr[31]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {haddr[30]}]
set_input_delay -clock hclk  -min 0  [get_ports {haddr[30]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {haddr[29]}]
set_input_delay -clock hclk  -min 0  [get_ports {haddr[29]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {haddr[28]}]
set_input_delay -clock hclk  -min 0  [get_ports {haddr[28]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {haddr[27]}]
set_input_delay -clock hclk  -min 0  [get_ports {haddr[27]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {haddr[26]}]
set_input_delay -clock hclk  -min 0  [get_ports {haddr[26]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {haddr[25]}]
set_input_delay -clock hclk  -min 0  [get_ports {haddr[25]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {haddr[24]}]
set_input_delay -clock hclk  -min 0  [get_ports {haddr[24]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {haddr[23]}]
set_input_delay -clock hclk  -min 0  [get_ports {haddr[23]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {haddr[22]}]
set_input_delay -clock hclk  -min 0  [get_ports {haddr[22]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {haddr[21]}]
set_input_delay -clock hclk  -min 0  [get_ports {haddr[21]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {haddr[20]}]
set_input_delay -clock hclk  -min 0  [get_ports {haddr[20]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {haddr[19]}]
set_input_delay -clock hclk  -min 0  [get_ports {haddr[19]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {haddr[18]}]
set_input_delay -clock hclk  -min 0  [get_ports {haddr[18]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {haddr[17]}]
set_input_delay -clock hclk  -min 0  [get_ports {haddr[17]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {haddr[16]}]
set_input_delay -clock hclk  -min 0  [get_ports {haddr[16]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {haddr[15]}]
set_input_delay -clock hclk  -min 0  [get_ports {haddr[15]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {haddr[14]}]
set_input_delay -clock hclk  -min 0  [get_ports {haddr[14]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {haddr[13]}]
set_input_delay -clock hclk  -min 0  [get_ports {haddr[13]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {haddr[12]}]
set_input_delay -clock hclk  -min 0  [get_ports {haddr[12]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {haddr[11]}]
set_input_delay -clock hclk  -min 0  [get_ports {haddr[11]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {haddr[10]}]
set_input_delay -clock hclk  -min 0  [get_ports {haddr[10]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {haddr[9]}]
set_input_delay -clock hclk  -min 0  [get_ports {haddr[9]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {haddr[8]}]
set_input_delay -clock hclk  -min 0  [get_ports {haddr[8]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {haddr[7]}]
set_input_delay -clock hclk  -min 0  [get_ports {haddr[7]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {haddr[6]}]
set_input_delay -clock hclk  -min 0  [get_ports {haddr[6]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {haddr[5]}]
set_input_delay -clock hclk  -min 0  [get_ports {haddr[5]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {haddr[4]}]
set_input_delay -clock hclk  -min 0  [get_ports {haddr[4]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {haddr[3]}]
set_input_delay -clock hclk  -min 0  [get_ports {haddr[3]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {haddr[2]}]
set_input_delay -clock hclk  -min 0  [get_ports {haddr[2]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {haddr[1]}]
set_input_delay -clock hclk  -min 0  [get_ports {haddr[1]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {haddr[0]}]
set_input_delay -clock hclk  -min 0  [get_ports {haddr[0]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {hburst[2]}]
set_input_delay -clock hclk  -min 0  [get_ports {hburst[2]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {hburst[1]}]
set_input_delay -clock hclk  -min 0  [get_ports {hburst[1]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {hburst[0]}]
set_input_delay -clock hclk  -min 0  [get_ports {hburst[0]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {hwdata[31]}]
set_input_delay -clock hclk  -min 0  [get_ports {hwdata[31]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {hwdata[30]}]
set_input_delay -clock hclk  -min 0  [get_ports {hwdata[30]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {hwdata[29]}]
set_input_delay -clock hclk  -min 0  [get_ports {hwdata[29]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {hwdata[28]}]
set_input_delay -clock hclk  -min 0  [get_ports {hwdata[28]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {hwdata[27]}]
set_input_delay -clock hclk  -min 0  [get_ports {hwdata[27]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {hwdata[26]}]
set_input_delay -clock hclk  -min 0  [get_ports {hwdata[26]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {hwdata[25]}]
set_input_delay -clock hclk  -min 0  [get_ports {hwdata[25]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {hwdata[24]}]
set_input_delay -clock hclk  -min 0  [get_ports {hwdata[24]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {hwdata[23]}]
set_input_delay -clock hclk  -min 0  [get_ports {hwdata[23]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {hwdata[22]}]
set_input_delay -clock hclk  -min 0  [get_ports {hwdata[22]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {hwdata[21]}]
set_input_delay -clock hclk  -min 0  [get_ports {hwdata[21]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {hwdata[20]}]
set_input_delay -clock hclk  -min 0  [get_ports {hwdata[20]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {hwdata[19]}]
set_input_delay -clock hclk  -min 0  [get_ports {hwdata[19]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {hwdata[18]}]
set_input_delay -clock hclk  -min 0  [get_ports {hwdata[18]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {hwdata[17]}]
set_input_delay -clock hclk  -min 0  [get_ports {hwdata[17]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {hwdata[16]}]
set_input_delay -clock hclk  -min 0  [get_ports {hwdata[16]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {hwdata[15]}]
set_input_delay -clock hclk  -min 0  [get_ports {hwdata[15]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {hwdata[14]}]
set_input_delay -clock hclk  -min 0  [get_ports {hwdata[14]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {hwdata[13]}]
set_input_delay -clock hclk  -min 0  [get_ports {hwdata[13]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {hwdata[12]}]
set_input_delay -clock hclk  -min 0  [get_ports {hwdata[12]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {hwdata[11]}]
set_input_delay -clock hclk  -min 0  [get_ports {hwdata[11]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {hwdata[10]}]
set_input_delay -clock hclk  -min 0  [get_ports {hwdata[10]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {hwdata[9]}]
set_input_delay -clock hclk  -min 0  [get_ports {hwdata[9]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {hwdata[8]}]
set_input_delay -clock hclk  -min 0  [get_ports {hwdata[8]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {hwdata[7]}]
set_input_delay -clock hclk  -min 0  [get_ports {hwdata[7]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {hwdata[6]}]
set_input_delay -clock hclk  -min 0  [get_ports {hwdata[6]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {hwdata[5]}]
set_input_delay -clock hclk  -min 0  [get_ports {hwdata[5]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {hwdata[4]}]
set_input_delay -clock hclk  -min 0  [get_ports {hwdata[4]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {hwdata[3]}]
set_input_delay -clock hclk  -min 0  [get_ports {hwdata[3]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {hwdata[2]}]
set_input_delay -clock hclk  -min 0  [get_ports {hwdata[2]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {hwdata[1]}]
set_input_delay -clock hclk  -min 0  [get_ports {hwdata[1]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {hwdata[0]}]
set_input_delay -clock hclk  -min 0  [get_ports {hwdata[0]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {sram_q[31]}]
set_input_delay -clock hclk  -min 0  [get_ports {sram_q[31]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {sram_q[30]}]
set_input_delay -clock hclk  -min 0  [get_ports {sram_q[30]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {sram_q[29]}]
set_input_delay -clock hclk  -min 0  [get_ports {sram_q[29]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {sram_q[28]}]
set_input_delay -clock hclk  -min 0  [get_ports {sram_q[28]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {sram_q[27]}]
set_input_delay -clock hclk  -min 0  [get_ports {sram_q[27]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {sram_q[26]}]
set_input_delay -clock hclk  -min 0  [get_ports {sram_q[26]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {sram_q[25]}]
set_input_delay -clock hclk  -min 0  [get_ports {sram_q[25]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {sram_q[24]}]
set_input_delay -clock hclk  -min 0  [get_ports {sram_q[24]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {sram_q[23]}]
set_input_delay -clock hclk  -min 0  [get_ports {sram_q[23]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {sram_q[22]}]
set_input_delay -clock hclk  -min 0  [get_ports {sram_q[22]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {sram_q[21]}]
set_input_delay -clock hclk  -min 0  [get_ports {sram_q[21]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {sram_q[20]}]
set_input_delay -clock hclk  -min 0  [get_ports {sram_q[20]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {sram_q[19]}]
set_input_delay -clock hclk  -min 0  [get_ports {sram_q[19]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {sram_q[18]}]
set_input_delay -clock hclk  -min 0  [get_ports {sram_q[18]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {sram_q[17]}]
set_input_delay -clock hclk  -min 0  [get_ports {sram_q[17]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {sram_q[16]}]
set_input_delay -clock hclk  -min 0  [get_ports {sram_q[16]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {sram_q[15]}]
set_input_delay -clock hclk  -min 0  [get_ports {sram_q[15]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {sram_q[14]}]
set_input_delay -clock hclk  -min 0  [get_ports {sram_q[14]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {sram_q[13]}]
set_input_delay -clock hclk  -min 0  [get_ports {sram_q[13]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {sram_q[12]}]
set_input_delay -clock hclk  -min 0  [get_ports {sram_q[12]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {sram_q[11]}]
set_input_delay -clock hclk  -min 0  [get_ports {sram_q[11]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {sram_q[10]}]
set_input_delay -clock hclk  -min 0  [get_ports {sram_q[10]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {sram_q[9]}]
set_input_delay -clock hclk  -min 0  [get_ports {sram_q[9]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {sram_q[8]}]
set_input_delay -clock hclk  -min 0  [get_ports {sram_q[8]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {sram_q[7]}]
set_input_delay -clock hclk  -min 0  [get_ports {sram_q[7]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {sram_q[6]}]
set_input_delay -clock hclk  -min 0  [get_ports {sram_q[6]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {sram_q[5]}]
set_input_delay -clock hclk  -min 0  [get_ports {sram_q[5]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {sram_q[4]}]
set_input_delay -clock hclk  -min 0  [get_ports {sram_q[4]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {sram_q[3]}]
set_input_delay -clock hclk  -min 0  [get_ports {sram_q[3]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {sram_q[2]}]
set_input_delay -clock hclk  -min 0  [get_ports {sram_q[2]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {sram_q[1]}]
set_input_delay -clock hclk  -min 0  [get_ports {sram_q[1]}]
set_input_delay -clock hclk  -max 3.8  [get_ports {sram_q[0]}]
set_input_delay -clock hclk  -min 0  [get_ports {sram_q[0]}]
set_output_delay -clock hclk  -max 3.8  [get_ports hready]
set_output_delay -clock hclk  -min 0  [get_ports hready]
set_output_delay -clock hclk  -max 3.8  [get_ports {hresp[1]}]
set_output_delay -clock hclk  -min 0  [get_ports {hresp[1]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {hresp[0]}]
set_output_delay -clock hclk  -min 0  [get_ports {hresp[0]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {hrdata[31]}]
set_output_delay -clock hclk  -min 0  [get_ports {hrdata[31]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {hrdata[30]}]
set_output_delay -clock hclk  -min 0  [get_ports {hrdata[30]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {hrdata[29]}]
set_output_delay -clock hclk  -min 0  [get_ports {hrdata[29]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {hrdata[28]}]
set_output_delay -clock hclk  -min 0  [get_ports {hrdata[28]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {hrdata[27]}]
set_output_delay -clock hclk  -min 0  [get_ports {hrdata[27]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {hrdata[26]}]
set_output_delay -clock hclk  -min 0  [get_ports {hrdata[26]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {hrdata[25]}]
set_output_delay -clock hclk  -min 0  [get_ports {hrdata[25]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {hrdata[24]}]
set_output_delay -clock hclk  -min 0  [get_ports {hrdata[24]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {hrdata[23]}]
set_output_delay -clock hclk  -min 0  [get_ports {hrdata[23]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {hrdata[22]}]
set_output_delay -clock hclk  -min 0  [get_ports {hrdata[22]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {hrdata[21]}]
set_output_delay -clock hclk  -min 0  [get_ports {hrdata[21]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {hrdata[20]}]
set_output_delay -clock hclk  -min 0  [get_ports {hrdata[20]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {hrdata[19]}]
set_output_delay -clock hclk  -min 0  [get_ports {hrdata[19]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {hrdata[18]}]
set_output_delay -clock hclk  -min 0  [get_ports {hrdata[18]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {hrdata[17]}]
set_output_delay -clock hclk  -min 0  [get_ports {hrdata[17]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {hrdata[16]}]
set_output_delay -clock hclk  -min 0  [get_ports {hrdata[16]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {hrdata[15]}]
set_output_delay -clock hclk  -min 0  [get_ports {hrdata[15]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {hrdata[14]}]
set_output_delay -clock hclk  -min 0  [get_ports {hrdata[14]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {hrdata[13]}]
set_output_delay -clock hclk  -min 0  [get_ports {hrdata[13]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {hrdata[12]}]
set_output_delay -clock hclk  -min 0  [get_ports {hrdata[12]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {hrdata[11]}]
set_output_delay -clock hclk  -min 0  [get_ports {hrdata[11]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {hrdata[10]}]
set_output_delay -clock hclk  -min 0  [get_ports {hrdata[10]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {hrdata[9]}]
set_output_delay -clock hclk  -min 0  [get_ports {hrdata[9]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {hrdata[8]}]
set_output_delay -clock hclk  -min 0  [get_ports {hrdata[8]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {hrdata[7]}]
set_output_delay -clock hclk  -min 0  [get_ports {hrdata[7]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {hrdata[6]}]
set_output_delay -clock hclk  -min 0  [get_ports {hrdata[6]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {hrdata[5]}]
set_output_delay -clock hclk  -min 0  [get_ports {hrdata[5]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {hrdata[4]}]
set_output_delay -clock hclk  -min 0  [get_ports {hrdata[4]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {hrdata[3]}]
set_output_delay -clock hclk  -min 0  [get_ports {hrdata[3]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {hrdata[2]}]
set_output_delay -clock hclk  -min 0  [get_ports {hrdata[2]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {hrdata[1]}]
set_output_delay -clock hclk  -min 0  [get_ports {hrdata[1]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {hrdata[0]}]
set_output_delay -clock hclk  -min 0  [get_ports {hrdata[0]}]
set_output_delay -clock hclk  -max 3.8  [get_ports sram_csn]
set_output_delay -clock hclk  -min 0  [get_ports sram_csn]
set_output_delay -clock hclk  -max 3.8  [get_ports sram_wen]
set_output_delay -clock hclk  -min 0  [get_ports sram_wen]
set_output_delay -clock hclk  -max 3.8  [get_ports {sram_a[11]}]
set_output_delay -clock hclk  -min 0  [get_ports {sram_a[11]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {sram_a[10]}]
set_output_delay -clock hclk  -min 0  [get_ports {sram_a[10]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {sram_a[9]}]
set_output_delay -clock hclk  -min 0  [get_ports {sram_a[9]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {sram_a[8]}]
set_output_delay -clock hclk  -min 0  [get_ports {sram_a[8]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {sram_a[7]}]
set_output_delay -clock hclk  -min 0  [get_ports {sram_a[7]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {sram_a[6]}]
set_output_delay -clock hclk  -min 0  [get_ports {sram_a[6]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {sram_a[5]}]
set_output_delay -clock hclk  -min 0  [get_ports {sram_a[5]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {sram_a[4]}]
set_output_delay -clock hclk  -min 0  [get_ports {sram_a[4]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {sram_a[3]}]
set_output_delay -clock hclk  -min 0  [get_ports {sram_a[3]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {sram_a[2]}]
set_output_delay -clock hclk  -min 0  [get_ports {sram_a[2]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {sram_a[1]}]
set_output_delay -clock hclk  -min 0  [get_ports {sram_a[1]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {sram_a[0]}]
set_output_delay -clock hclk  -min 0  [get_ports {sram_a[0]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {sram_d[31]}]
set_output_delay -clock hclk  -min 0  [get_ports {sram_d[31]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {sram_d[30]}]
set_output_delay -clock hclk  -min 0  [get_ports {sram_d[30]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {sram_d[29]}]
set_output_delay -clock hclk  -min 0  [get_ports {sram_d[29]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {sram_d[28]}]
set_output_delay -clock hclk  -min 0  [get_ports {sram_d[28]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {sram_d[27]}]
set_output_delay -clock hclk  -min 0  [get_ports {sram_d[27]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {sram_d[26]}]
set_output_delay -clock hclk  -min 0  [get_ports {sram_d[26]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {sram_d[25]}]
set_output_delay -clock hclk  -min 0  [get_ports {sram_d[25]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {sram_d[24]}]
set_output_delay -clock hclk  -min 0  [get_ports {sram_d[24]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {sram_d[23]}]
set_output_delay -clock hclk  -min 0  [get_ports {sram_d[23]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {sram_d[22]}]
set_output_delay -clock hclk  -min 0  [get_ports {sram_d[22]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {sram_d[21]}]
set_output_delay -clock hclk  -min 0  [get_ports {sram_d[21]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {sram_d[20]}]
set_output_delay -clock hclk  -min 0  [get_ports {sram_d[20]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {sram_d[19]}]
set_output_delay -clock hclk  -min 0  [get_ports {sram_d[19]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {sram_d[18]}]
set_output_delay -clock hclk  -min 0  [get_ports {sram_d[18]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {sram_d[17]}]
set_output_delay -clock hclk  -min 0  [get_ports {sram_d[17]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {sram_d[16]}]
set_output_delay -clock hclk  -min 0  [get_ports {sram_d[16]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {sram_d[15]}]
set_output_delay -clock hclk  -min 0  [get_ports {sram_d[15]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {sram_d[14]}]
set_output_delay -clock hclk  -min 0  [get_ports {sram_d[14]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {sram_d[13]}]
set_output_delay -clock hclk  -min 0  [get_ports {sram_d[13]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {sram_d[12]}]
set_output_delay -clock hclk  -min 0  [get_ports {sram_d[12]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {sram_d[11]}]
set_output_delay -clock hclk  -min 0  [get_ports {sram_d[11]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {sram_d[10]}]
set_output_delay -clock hclk  -min 0  [get_ports {sram_d[10]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {sram_d[9]}]
set_output_delay -clock hclk  -min 0  [get_ports {sram_d[9]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {sram_d[8]}]
set_output_delay -clock hclk  -min 0  [get_ports {sram_d[8]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {sram_d[7]}]
set_output_delay -clock hclk  -min 0  [get_ports {sram_d[7]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {sram_d[6]}]
set_output_delay -clock hclk  -min 0  [get_ports {sram_d[6]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {sram_d[5]}]
set_output_delay -clock hclk  -min 0  [get_ports {sram_d[5]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {sram_d[4]}]
set_output_delay -clock hclk  -min 0  [get_ports {sram_d[4]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {sram_d[3]}]
set_output_delay -clock hclk  -min 0  [get_ports {sram_d[3]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {sram_d[2]}]
set_output_delay -clock hclk  -min 0  [get_ports {sram_d[2]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {sram_d[1]}]
set_output_delay -clock hclk  -min 0  [get_ports {sram_d[1]}]
set_output_delay -clock hclk  -max 3.8  [get_ports {sram_d[0]}]
set_output_delay -clock hclk  -min 0  [get_ports {sram_d[0]}]
