###################################################################

# Created by write_sdc on Sun Nov 13 17:29:35 2022

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_max_area 0
set_load -pin_load 0.2 [get_ports vld_out]
set_load -pin_load 0.2 [get_ports {dout[9]}]
set_load -pin_load 0.2 [get_ports {dout[8]}]
set_load -pin_load 0.2 [get_ports {dout[7]}]
set_load -pin_load 0.2 [get_ports {dout[6]}]
set_load -pin_load 0.2 [get_ports {dout[5]}]
set_load -pin_load 0.2 [get_ports {dout[4]}]
set_load -pin_load 0.2 [get_ports {dout[3]}]
set_load -pin_load 0.2 [get_ports {dout[2]}]
set_load -pin_load 0.2 [get_ports {dout[1]}]
set_load -pin_load 0.2 [get_ports {dout[0]}]
set_ideal_network -no_propagate  [get_ports rst_n]
create_clock [get_ports clk]  -period 9.5  -waveform {0 4.75}
set_clock_latency -max 0.95  [get_clocks clk]
set_clock_latency -source 0.95  [get_clocks clk]
set_clock_uncertainty 0.475  [get_clocks clk]
set_clock_transition -max -rise 0.095 [get_clocks clk]
set_clock_transition -max -fall 0.095 [get_clocks clk]
set_clock_transition -min -rise 0.095 [get_clocks clk]
set_clock_transition -min -fall 0.095 [get_clocks clk]
set_false_path   -from [get_ports rst_n]
set_input_delay -clock clk  -max 3.8  [get_ports rst_n]
set_input_delay -clock clk  -min 0  [get_ports rst_n]
set_input_delay -clock clk  -max 3.8  [get_ports vld_in]
set_input_delay -clock clk  -min 0  [get_ports vld_in]
set_input_delay -clock clk  -max 3.8  [get_ports {din[9]}]
set_input_delay -clock clk  -min 0  [get_ports {din[9]}]
set_input_delay -clock clk  -max 3.8  [get_ports {din[8]}]
set_input_delay -clock clk  -min 0  [get_ports {din[8]}]
set_input_delay -clock clk  -max 3.8  [get_ports {din[7]}]
set_input_delay -clock clk  -min 0  [get_ports {din[7]}]
set_input_delay -clock clk  -max 3.8  [get_ports {din[6]}]
set_input_delay -clock clk  -min 0  [get_ports {din[6]}]
set_input_delay -clock clk  -max 3.8  [get_ports {din[5]}]
set_input_delay -clock clk  -min 0  [get_ports {din[5]}]
set_input_delay -clock clk  -max 3.8  [get_ports {din[4]}]
set_input_delay -clock clk  -min 0  [get_ports {din[4]}]
set_input_delay -clock clk  -max 3.8  [get_ports {din[3]}]
set_input_delay -clock clk  -min 0  [get_ports {din[3]}]
set_input_delay -clock clk  -max 3.8  [get_ports {din[2]}]
set_input_delay -clock clk  -min 0  [get_ports {din[2]}]
set_input_delay -clock clk  -max 3.8  [get_ports {din[1]}]
set_input_delay -clock clk  -min 0  [get_ports {din[1]}]
set_input_delay -clock clk  -max 3.8  [get_ports {din[0]}]
set_input_delay -clock clk  -min 0  [get_ports {din[0]}]
set_output_delay -clock clk  -max 3.8  [get_ports vld_out]
set_output_delay -clock clk  -min 0  [get_ports vld_out]
set_output_delay -clock clk  -max 3.8  [get_ports {dout[9]}]
set_output_delay -clock clk  -min 0  [get_ports {dout[9]}]
set_output_delay -clock clk  -max 3.8  [get_ports {dout[8]}]
set_output_delay -clock clk  -min 0  [get_ports {dout[8]}]
set_output_delay -clock clk  -max 3.8  [get_ports {dout[7]}]
set_output_delay -clock clk  -min 0  [get_ports {dout[7]}]
set_output_delay -clock clk  -max 3.8  [get_ports {dout[6]}]
set_output_delay -clock clk  -min 0  [get_ports {dout[6]}]
set_output_delay -clock clk  -max 3.8  [get_ports {dout[5]}]
set_output_delay -clock clk  -min 0  [get_ports {dout[5]}]
set_output_delay -clock clk  -max 3.8  [get_ports {dout[4]}]
set_output_delay -clock clk  -min 0  [get_ports {dout[4]}]
set_output_delay -clock clk  -max 3.8  [get_ports {dout[3]}]
set_output_delay -clock clk  -min 0  [get_ports {dout[3]}]
set_output_delay -clock clk  -max 3.8  [get_ports {dout[2]}]
set_output_delay -clock clk  -min 0  [get_ports {dout[2]}]
set_output_delay -clock clk  -max 3.8  [get_ports {dout[1]}]
set_output_delay -clock clk  -min 0  [get_ports {dout[1]}]
set_output_delay -clock clk  -max 3.8  [get_ports {dout[0]}]
set_output_delay -clock clk  -min 0  [get_ports {dout[0]}]
